# Pandas 기초

In [2]:
import pandas as pd

In [3]:
data = {
    "Name": ["John", "Anna", "Peter"],
    "Age" : [20,30,10],
    "City": ["Seoul", "Busan", "Daegu"]
}

df = pd.DataFrame(data)
df.to_csv("sample_date.csv", index=False)

In [4]:
df = pd.read_csv("sample_date.csv")
df

    Name  Age   City
0   John   20  Seoul
1   Anna   30  Busan
2  Peter   10  Daegu

In [5]:
print("Original DataFrame")
print(df)

Original DataFrame
    Name  Age   City
0   John   20  Seoul
1   Anna   30  Busan
2  Peter   10  Daegu

In [6]:
# 열에 접근하여 출력
print("Age Column:")
print(df["Age"])

Age Column:
0    20
1    30
2    10
Name: Age, dtype: int64

In [7]:
# 데이터 필터링
filtered_df = df[df["Age"] > 20]
print("Filtered DataFrame")
print(filtered_df)

Filtered DataFrame
   Name  Age   City
1  Anna   30  Busan

In [8]:
# 새 열 추가.
df["Salary"] = [100, 200, 300]
print("Add Salary Column")
print(df)

Add Salary Column
    Name  Age   City  Salary
0   John   20  Seoul     100
1   Anna   30  Busan     200
2  Peter   10  Daegu     300

In [9]:
# Series 컬럼의 타입
type(df["Age"][0])

numpy.int64

In [10]:
import numpy as np

In [13]:
# 데이터 준비
np.random.seed(0)
data = {
    "Name": np.random.choice(["John", "Anna", "Peter","Jay","Eve", None], size =1000),
    "Age" : np.random.randint(20,60, size=1000),
    "City" : np.random.choice(
        ["Seoul", "Busan", "Daegu", "Incheon", "Suwon", "London"], size=1000
    ),
    "Salary" : np.random.randint(20000, 50000, size=1000)
}

df = pd.DataFrame(data)
df.to_csv("sample_data_ver2.csv", index=False)

departments = ["HR", "Marketing", "Sales", "IT", "Management"]
np.random.seed(0)
df2 = pd.DataFrame({
    "Name": df["Name"].dropna().unique(),
    "Department": np.random.choice(departments, size=len(df["Name"].dropna().unique()))
})

df2.to_csv("sample_data_ver3.csv", index=False)

In [14]:
df = pd.read_csv("sample_data_ver2.csv")
df

     Name  Age    City  Salary
0     Eve   35   Seoul   30940
1     NaN   40   Suwon   20889
2    John   29  London   47456
3     Jay   24   Daegu   41581
4     Jay   44   Daegu   29740
..    ...  ...     ...     ...
995   Eve   24   Busan   42496
996   NaN   30  London   41712
997   NaN   26  London   48546
998   Jay   28   Seoul   48154
999  John   28   Suwon   23495

[1000 rows x 4 columns]

In [15]:
df.to_csv("new_sample_data_ver2.csv", index=False)

new_df = pd.read_csv("new_sample_data_ver2.csv")
new_df

     Name  Age    City  Salary
0     Eve   35   Seoul   30940
1     NaN   40   Suwon   20889
2    John   29  London   47456
3     Jay   24   Daegu   41581
4     Jay   44   Daegu   29740
..    ...  ...     ...     ...
995   Eve   24   Busan   42496
996   NaN   30  London   41712
997   NaN   26  London   48546
998   Jay   28   Seoul   48154
999  John   28   Suwon   23495

[1000 rows x 4 columns]

In [16]:
df.to_excel("new_sample_data_ver2.xlsx", index=False)

new_df = pd.read_excel("new_sample_data_ver2.xlsx")
new_df

     Name  Age    City  Salary
0     Eve   35   Seoul   30940
1     NaN   40   Suwon   20889
2    John   29  London   47456
3     Jay   24   Daegu   41581
4     Jay   44   Daegu   29740
..    ...  ...     ...     ...
995   Eve   24   Busan   42496
996   NaN   30  London   41712
997   NaN   26  London   48546
998   Jay   28   Seoul   48154
999  John   28   Suwon   23495

[1000 rows x 4 columns]

In [17]:
df.to_json("new_sample_data_ver2.json")

new_df = pd.read_json("new_sample_data_ver2.json")
new_df

     Name  Age    City  Salary
0     Eve   35   Seoul   30940
1    None   40   Suwon   20889
2    John   29  London   47456
3     Jay   24   Daegu   41581
4     Jay   44   Daegu   29740
..    ...  ...     ...     ...
995   Eve   24   Busan   42496
996  None   30  London   41712
997  None   26  London   48546
998   Jay   28   Seoul   48154
999  John   28   Suwon   23495

[1000 rows x 4 columns]

In [18]:
df.to_json("new_sample_data_ver2.json", orient="records", lines=True)

new_df = pd.read_json("new_sample_data_ver2.json", lines=True)
new_df

     Name  Age    City  Salary
0     Eve   35   Seoul   30940
1    None   40   Suwon   20889
2    John   29  London   47456
3     Jay   24   Daegu   41581
4     Jay   44   Daegu   29740
..    ...  ...     ...     ...
995   Eve   24   Busan   42496
996  None   30  London   41712
997  None   26  London   48546
998   Jay   28   Seoul   48154
999  John   28   Suwon   23495

[1000 rows x 4 columns]

# 데이터 정제

In [19]:
# 데이터 불러오기
df = pd.read_csv("sample_data_ver2.csv")

# 나이가 30세 이상인 사람들만 필터링
order_than_30 = df[df["Age"] >= 30]
order_than_30

      Name  Age     City  Salary
0      Eve   35    Seoul   30940
1      NaN   40    Suwon   20889
4      Jay   44    Daegu   29740
5      Jay   50   London   32998
7      Jay   39    Busan   38993
..     ...  ...      ...     ...
989  Peter   37    Busan   33436
990    NaN   42  Incheon   24932
991    Eve   33    Busan   22624
993    NaN   31   London   22116
996    NaN   30   London   41712

[769 rows x 4 columns]

In [20]:
# 데이터 불러오기
df = pd.read_csv("sample_data_ver2.csv")

# 나이가 30세 이상이며, 서울에 사는 사람들만 필터링
order_than_30_and_seoul = df[(df["Age"] >= 30) & (df["City"] == "Seoul")]
order_than_30_and_seoul.head()

    Name  Age   City  Salary
0    Eve   35  Seoul   30940
17  Anna   41  Seoul   48119
18   NaN   40  Seoul   26447
20   NaN   57  Seoul   42950
32  Anna   45  Seoul   21032

In [21]:
# 데이터 불러오기
df = pd.read_csv("sample_data_ver2.csv")

# 이름이 None인 행 제거
df_not_null = df[df["Name"].notna()]
df_not_null

     Name  Age    City  Salary
0     Eve   35   Seoul   30940
2    John   29  London   47456
3     Jay   24   Daegu   41581
4     Jay   44   Daegu   29740
5     Jay   50  London   32998
..    ...  ...     ...     ...
992  Anna   22   Daegu   40369
994   Jay   29  London   47851
995   Eve   24   Busan   42496
998   Jay   28   Seoul   48154
999  John   28   Suwon   23495

[829 rows x 4 columns]

In [22]:
# 데이터 불러오기
df = pd.read_csv("sample_data_ver2.csv")


df_not_null = df[df["Name"].isna()]
df_not_null

    Name  Age     City  Salary
1    NaN   40    Suwon   20889
8    NaN   23   London   28323
18   NaN   40    Seoul   26447
20   NaN   57    Seoul   42950
27   NaN   54    Suwon   49465
..   ...  ...      ...     ...
986  NaN   21    Daegu   48758
990  NaN   42  Incheon   24932
993  NaN   31   London   22116
996  NaN   30   London   41712
997  NaN   26   London   48546

[171 rows x 4 columns]

In [24]:
# 데이터 불러오기
df = pd.read_csv("sample_data_ver2.csv")

# like
df_with_a = df[df["Name"].str.contains("a", na=False)]
df_with_a

     Name  Age     City  Salary
3     Jay   24    Daegu   41581
4     Jay   44    Daegu   29740
5     Jay   50   London   32998
6    Anna   22   London   21137
7     Jay   39    Busan   38993
..    ...  ...      ...     ...
979   Jay   56    Daegu   22844
980  Anna   41  Incheon   32670
992  Anna   22    Daegu   40369
994   Jay   29   London   47851
998   Jay   28    Seoul   48154

[340 rows x 4 columns]

# 데이터 변환

In [26]:
# 데이터 불러오기
df = pd.read_csv("sample_data_ver2.csv")

# 이름 대문자로 변환
df["Name"] = df["Name"].apply(lambda x: x.upper() if pd.notna(x) else x)
df

     Name  Age    City  Salary
0     EVE   35   Seoul   30940
1     NaN   40   Suwon   20889
2    JOHN   29  London   47456
3     JAY   24   Daegu   41581
4     JAY   44   Daegu   29740
..    ...  ...     ...     ...
995   EVE   24   Busan   42496
996   NaN   30  London   41712
997   NaN   26  London   48546
998   JAY   28   Seoul   48154
999  JOHN   28   Suwon   23495

[1000 rows x 4 columns]

In [27]:
# 데이터 불러오기
df = pd.read_csv("sample_data_ver2.csv")

# 이름과 도시를 결합한 새로운 컬럼 생성
def process(row: pd.Series) -> str:
    if pd.notna(row['Name']):
        return f"{row['Name']}({row['City']})"
    else:
        return f"Unknown from {row['City']}"
df["Name_City"] = df.apply(process, axis=1)
df

     Name  Age    City  Salary            Name_City
0     Eve   35   Seoul   30940           Eve(Seoul)
1     NaN   40   Suwon   20889   Unknown from Suwon
2    John   29  London   47456         John(London)
3     Jay   24   Daegu   41581           Jay(Daegu)
4     Jay   44   Daegu   29740           Jay(Daegu)
..    ...  ...     ...     ...                  ...
995   Eve   24   Busan   42496           Eve(Busan)
996   NaN   30  London   41712  Unknown from London
997   NaN   26  London   48546  Unknown from London
998   Jay   28   Seoul   48154           Jay(Seoul)
999  John   28   Suwon   23495          John(Suwon)

[1000 rows x 5 columns]

# 데이터 집계/조인

In [28]:
# 데이터 불러오기
df = pd.read_csv("sample_data_ver2.csv")

# 평균 연봉 계산
average_salary = df["Salary"].mean()
average_salary

34854.766

In [29]:
# 데이터 불러오기
df = pd.read_csv("sample_data_ver2.csv")

# 도시별 평균 나이 계싼
average_age_by_city = df.groupby("City")["Age"].mean()
average_age_by_city

City
Busan      39.987261
Daegu      38.596491
Incheon    39.914439
London     38.686747
Seoul      40.320261
Suwon      40.493976
Name: Age, dtype: float64

In [30]:
# 데이터 불러오기
df = pd.read_csv("sample_data_ver2.csv")

# 이름 대문자로 변환
aggregated_date = df.agg({"Age": ["min", "max", "mean"], "Salary": ["min", "max", "mean"]})
aggregated_date

         Age     Salary
min   20.000  20010.000
max   59.000  49936.000
mean  39.655  34854.766

In [31]:
# 데이터 불러오기
df1 = pd.read_csv("sample_data_ver2.csv")
df2 = pd.read_csv("sample_data_ver3.csv")

# 이름을 기준으로 inner join
inner_joined = pd.merge(df1, df2, on="Name", how="inner")
inner_joined

      Name  Age    City  Salary  Department
0      Eve   35   Seoul   30940  Management
1      Eve   31   Daegu   23187  Management
2      Eve   37   Busan   47021  Management
3      Eve   56   Daegu   37254  Management
4      Eve   46  London   23843  Management
..     ...  ...     ...     ...         ...
824  Peter   34   Seoul   26182          IT
825  Peter   50   Suwon   28374          IT
826  Peter   35   Suwon   37823          IT
827  Peter   35   Daegu   43026          IT
828  Peter   37   Busan   33436          IT

[829 rows x 5 columns]

In [32]:
# 데이터 불러오기
df1 = pd.read_csv("sample_data_ver2.csv")
df2 = pd.read_csv("sample_data_ver3.csv")

# 이름을 기준으로 outer join
outer_joined = pd.merge(df1, df2, on="Name", how="outer")
outer_joined

      Name  Age    City  Salary  Department
0      Eve   35   Seoul   30940  Management
1      Eve   31   Daegu   23187  Management
2      Eve   37   Busan   47021  Management
3      Eve   56   Daegu   37254  Management
4      Eve   46  London   23843  Management
..     ...  ...     ...     ...         ...
995  Peter   34   Seoul   26182          IT
996  Peter   50   Suwon   28374          IT
997  Peter   35   Suwon   37823          IT
998  Peter   35   Daegu   43026          IT
999  Peter   37   Busan   33436          IT

[1000 rows x 5 columns]

In [33]:
outer_joined[outer_joined["Name"].isna()]

    Name  Age     City  Salary Department
161  NaN   40    Suwon   20889        NaN
162  NaN   23   London   28323        NaN
163  NaN   40    Seoul   26447        NaN
164  NaN   57    Seoul   42950        NaN
165  NaN   54    Suwon   49465        NaN
..   ...  ...      ...     ...        ...
327  NaN   21    Daegu   48758        NaN
328  NaN   42  Incheon   24932        NaN
329  NaN   31   London   22116        NaN
330  NaN   30   London   41712        NaN
331  NaN   26   London   48546        NaN

[171 rows x 5 columns]